/*1.
На основі AJAX технології напишіть клієнтську частину аплікації (HTML+JavaScript), в якій при натисненні на кнопку надсилається асинхронний GET-запит на сервер, сервер обробляє запит і надсилає його на HTML-сторінку оновлюючи вміст кнопки так як показано в прикладі. 
Зображення
2.
На основі AJAX технології напишіть клієнтську частину аплікації (HTML+JavaScript), в якій при натисненні на кнопку надсилається асинхронний GET-запит на сервер, завантажується файл books.json і з нього виводяться всі назви авторів у вигляді списку на HTML-сторінку.
Зображення
3.
Використати сервіс: https://randomuser.me/
Та при кожному завантаженні сторінки робити запит до API та рендерити базову інформацію про користувача (аватар, ім`я, вік, стать, країна, логін, пароль, пошта).*/